Tekla Open API Reference for Tekla Structures 2025
ReinforcementSetGroup.GetModelIdentifiers Method
 Gets the model identifiers of the single rebars in this reinforcement set group.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<Identifier> GetModelIdentifiers()
Public Function GetModelIdentifiers As List(Of Identifier)
Return Value
Type: List<Identifier>
A list of model identifiers.
See Also
Reference
ReinforcementSetGroup Class
Tekla.Structures.Drawing Namespace